[{"Question":{"text":"Revolving Loan Core","q_type":"1"},"Data":[{"document_answers":[{"text":"a multicurrency revolving loan facility in an aggregate amount equal to the Total Facility A Commitments","start":40970,"end":41074}],"document_name":"29_Seawell_evaluationset.txt"},{"document_answers":[{"text":"The Lenders, individually, and not solidarily (and not jointly and severally), agree to make available to the Borrowers a revolving credit facility (the “Revolving Facility”).","start":66822,"end":66997}],"document_name":"03_SNC_trainingset.txt"},{"document_answers":[{"text":"a Base Currency revolving credit facility in an aggregate amount equal to the Total Capex Facility Commitments capable of being reborrowed as contemplated by this Agreement;","start":46506,"end":46679}],"document_name":"06_Caruna_trainingset.txt"},{"document_answers":[{"text":"Subject to the terms of this Agreement, the Lenders make available to the Borrower a dollar revolving loan facility with a term out option in an aggregate amount equal to the Total Commitments.","start":39329,"end":39522}],"document_name":"13_GFI_trainingset.txt"},{"document_answers":[{"text":"Subject to the terms of this Agreement, the Banks agree to make a Loan during the Commitment Period to the Borrower up\nto an aggregate principal amount not exceeding the Total Commitments.","start":59118,"end":59306}],"document_name":"20_Nordural_trainingset.txt"},{"document_answers":[{"text":"Subject to the terms and conditions set forth herein, each Lender agrees to make Loans to the Borrower from time to time during the Availability Period in an aggregate principal amount that will not \nresult in (a) the aggregate outstanding principal amount of such Lender’s Loans exceeding such Lender’s Commitment or (b) the sum of the aggregate outstanding principal amount of all Loans exceeding the total \nCommitments. Within the foregoing limits and subject to the terms and conditions set forth herein, the Borrower may borrow, prepay and reborrow Loans","start":61174,"end":61733}],"document_name":"22_Zynga_evaluationset.txt"},{"document_answers":[{"text":"Subject to the terms and conditions set forth herein, (a) each Tranche A Lender agrees to make Tranche A Loans (denominated in dollars) to the Borrowers from time to time on any Business Day during the applicable Availability Period in an aggregate principal amount that will not result in (i) such Tranche A Lender’s applicable Credit Exposure exceeding such Tranche A Lender’s Tranche A Commitment or (ii) the sum of the total applicable Credit Exposures exceeding the total Tranche A Commitments","start":71566,"end":72064}],"document_name":"11_Teva_trainingset.txt"},{"document_answers":[{"text":"a Base Currency revolving credit facility in an aggregate amount equal to the Total Capex Facility Commitments capable of being reborrowed as contemplated by this Agreement (the “Capex Facility”);","start":46922,"end":47118},{"text":"a multi-currency working capital facility in an aggregate amount equal to the Total WC Facility Commitments, capable of being reborrowed as contemplated by this Agreement (the “WC Facility”)","start":47129,"end":47319}],"document_name":"12_ellevio_trainingset.txt"},{"document_answers":[{"text":"Subject to the terms of this Agreement, the Lenders make available to the Borrower a USD committed revolving credit facility in an aggregate amount equal to the Total Commitments.","start":69655,"end":69834}],"document_name":"15_Harmony_trainingset.txt"},{"document_answers":[{"text":"Subject to the terms and conditions hereof, each Lender severally agrees to make a loan or loans (individually a “Revolving Loan” and collectively “Revolving Loans”) to the Borrower from time to time on a revolving basis in U.S. Dollars and Alternative Currencies in an aggregate outstanding Original Dollar Amount up to the amount of its Revolving Credit Commitment subject to any increases or reductions thereof pursuant to the terms hereof, before the Termination Date","start":12329,"end":12800}],"document_name":"05_JLL_trainingset.txt"},{"document_answers":[{"text":"to the Borrowers, a multicurrency revolving credit facility in an aggregate amount equal to the Total Facility C Commitments being £2,000,000 at the date of this Agreement.","start":63583,"end":63755}],"document_name":"19_Ixeurope_trainingset.txt"},{"document_answers":[{"text":"Commitment to Lend Revolving Credit Loans. Subject to the terms and conditions set forth in this Credit Agreement, each of the Lenders severally agrees from time to time during the Revolver Period to make Revolving Credit Loans to the Borrower in Dollars or","start":83596,"end":83853},{"text":"in one or more Alternative Currencies and in such amounts as are requested by the Borrower;","start":83882,"end":83973}],"document_name":"30_Staples_evaluationset.txt"},{"document_answers":[{"text":"Subject to the terms and conditions set forth herein, each Lender severally agrees to make loans (each such loan, a “Committed Loan”) to the Borrower in Dollars or in one or more Alternative Currencies from time to time, on any Business Day during the Availability Period, in an aggregate amount not to exceed at any time outstanding the amount of such Lender’s Commitment;","start":114880,"end":115253}],"document_name":"10_Clarcor_trainingset.txt"},{"document_answers":[{"text":"Subject to the terms of this Agreement, the Lenders make available to the Borrowers a multicurrency revolving loan facility in an aggregate amount the Base Currency Amount of which is equal to the Total Commitments","start":76176,"end":76390}],"document_name":"18_Interxion_trainingset.txt"},{"document_answers":[{"text":"the Facility B Lenders make available to the Borrower a revolving credit facility in Singapore Dollars in an aggregate amount equal to the Total Facility B Commitments","start":142482,"end":142649}],"document_name":"23_Marina_evaluationset.txt"},{"document_answers":[{"text":"to the Revolving Facility Borrowers, a multicurrency revolving credit facility in an aggregate Base Currency Amount which is equal to the Total Original Revolving Facility Commitments.","start":133437,"end":133621}],"document_name":"25_Nomad__evaluationset.txt"},{"document_answers":[{"text":"to the Borrowers, a multicurrency revolving credit facility in an aggregate amount, the Base Currency Amount of which is equal to the Total Revolving Facility Commitments.","start":135869,"end":136040}],"document_name":"08_Chain_trainingset.txt"},{"document_answers":[{"text":"Subject to the terms and conditions of this Agreement, and in reliance upon the \nrepresentations and warranties set forth herein, each Revolving Credit Lender severally agrees to make Revolving Loans in a Permitted Currency to the Borrower from time to time from the Closing Date through, but not including, the Maturity Date as requested by the Borrower in accordance with the terms of Section 2.03","start":93271,"end":93670}],"document_name":"16_CHOICE_trainingset.txt"},{"document_answers":[{"text":"Revolving Commitments. During the Revolving Commitment Period, subject to the terms and conditions hereof, each Lender agrees to make Revolving Loans in US Dollars to the Borrowers in an aggregate principal amount","start":216262,"end":216475}],"document_name":"14_CHRYSLER_trainingset.txt"},{"document_answers":[{"text":"Subject to the terms and conditions set forth herein, each Revolving Lender severally\nagrees to make Revolving Loans to the Borrowers from time to time during the Availability Period in an aggregate principal amount","start":204598,"end":204813}],"document_name":"01_JCP_trainingset.txt"},{"document_answers":[{"text":"Subject to the terms and conditions set forth herein, each Lender severally agrees to make loans (each such loan, a “Committed Loan”) to the Borrowers from time to time, on any Business Day during the Availability Period,","start":174727,"end":174948}],"document_name":"21_B&N_evaluationset.txt"},{"document_answers":[{"text":"Subject to the terms of this Agreement, the Lenders make available to the Borrowers a euro revolving credit facility in an aggregate amount equal to the Total Original Revolving Facility Commitments.","start":95088,"end":95287}],"document_name":"04_Unitymedia_trainingset.txt"},{"document_answers":[{"text":"Subject to the terms and conditions set forth herein, each Revolving Credit Lender severally agrees to make Loans denominated in Dollars or an Alternative Currency to the Borrower from its applicable Lending Office (each such loan, a “Revolving Credit Loan”) from time to time, on any Business Day during the period from and including the Distribution Date until the Business Day preceding the Maturity Date for the Revolving Credit Facility","start":200102,"end":200543}],"document_name":"26_TIME_evaluationset.txt"},{"document_answers":[{"text":"Subject to the terms and conditions herein set forth, each Lender agrees to make Revolving Loans to the Borrower from time to time during the Availability Period in an aggregate principal amount","start":188221,"end":188415}],"document_name":"17_CDW_trainingset.txt"},{"document_answers":[{"text":"Subject to the terms of this Agreement, the Lenders shall make available a multicurrency revolving credit \nfacility in an aggregate amount the Base Currency Amount of which is equal to the Total Revolving Facility Commitments","start":259746,"end":259971}],"document_name":"24_Wireco_evaluationset.txt"},{"document_answers":[{"text":"Subject to the terms and conditions and relying upon the representations and warranties herein set forth, each Lender agrees, severally and not jointly to make\n(x) Australian Revolving Loans in dollars to any Australian Borrower, (y) Dutch Revolving Loans, at the applicable Borrower’s option, in dollars or euros to any Dutch Borrower and (z) U.S. Revolving Loans, at the applicable Borrower’s option, in dollars or euros to any U.S. Borrower, in each case at any time and from time to time on or after the Closing Date until the earlier of one Business Day prior to the Revolving Maturity Date and the termination of the Revolving Commitment of such Lender in accordance with the terms hereof","start":222272,"end":222966}],"document_name":"02_Tronox_trainingset.txt"},{"document_answers":[{"text":"Each Canadian Revolver Lender has made Canadian Revolver Loans to the Canadian Borrowers prior to the Restatement Closing Date, and agrees, severally and not jointly with the other Canadian Revolver Lenders, upon the terms and subject to the conditions set forth herein, to make Canadian Revolver Loans to any of the Canadian Borrowers on any Business Day during the period from the Restatement Closing Date to the Canadian Revolver Commitment Termination Date, not to exceed in aggregate principal amount outstanding at any time","start":422384,"end":422913}],"document_name":"07_OPT1_trainingset.txt"}]},{"Question":{"text":"Revolving Loan All","q_type":"1"},"Data":[{"document_answers":[{"text":"2\tTHE FACILITIES\n2.1\tThe Facilities\n(a) Subject to the terms of this Agreement, the Lenders make available to the Borrowers:\n(i) a multicurrency revolving loan facility in an aggregate amount equal to the Total Facility A Commitments;\n(ii) a multicurrency revolving loan facility in an aggregate amount equal to the Total Facility B Commitments;","start":40841,"end":41186}],"document_name":"29_Seawell_evaluationset.txt"},{"document_answers":[{"text":"2 - THE FACILITIES\n2.1 The Revolving Facility\nThe Lenders, individually, and not solidarily (and not jointly and severally), agree to make available to the Borrowers a revolving credit facility (the “Revolving Facility”). The Revolving Facility is comprised of three Tranches; Tranche A which is in an amount of $2,000,000,000 less the Dollar equivalent at any time of £400,000,000 until the reallocation provided in Section 2.6, Tranche B which is in an amount of $750,000,000 and Tranche C which is in an amount of £400,000,000. On the date hereof, the Commitment of each Lender under the Revolving Facility and each tranche thereof is as specified opposite its name in Schedule B and on the signature pages of this Agreement and the collective Commitments of the Lenders with respect to the Revolving Facility expressed in Dollars aggregate to $2,750,000,000.","start":66776,"end":67638}],"document_name":"03_SNC_trainingset.txt"},{"document_answers":[{"text":"2 \tThe Facilities \n2.1 \tThe Facilities \n\t2.1.1 \tSubject to the terms of this Agreement, the Lenders make available: ","start":46279,"end":46395},{"text":"(ii) a Base Currency revolving credit facility in an aggregate amount equal to the Total Capex Facility Commitments capable of being reborrowed as contemplated by this Agreement;  ","start":46501,"end":46681}],"document_name":"06_Caruna_trainingset.txt"},{"document_answers":[{"text":"2. THE FACILITY\n2.1 The Facility\nSubject to the terms of this Agreement, the Lenders make available to the Borrower a dollar revolving loan facility with a term out option in an aggregate amount equal to the Total Commitments.","start":39296,"end":39522}],"document_name":"13_GFI_trainingset.txt"},{"document_answers":[{"text":"2. FACILITY\n2.1 Facility\nSubject to the terms of this Agreement, the Banks agree to make a Loan during the Commitment Period to the Borrower up\nto an aggregate principal amount not exceeding the Total Commitments. No Bank is obliged to lend more than its Commitment.","start":59093,"end":59359}],"document_name":"20_Nordural_trainingset.txt"},{"document_answers":[{"text":"ARTICLE II \nThe Credits \nSection 2.1 Commitments. Subject to the terms and conditions set forth herein, each Lender agrees to make Loans to the Borrower from time to time during the Availability Period in an aggregate principal amount that will not \nresult in (a) the aggregate outstanding principal amount of such Lender’s Loans exceeding such Lender’s Commitment or (b) the sum of the aggregate outstanding principal amount of all Loans exceeding the total \nCommitments. Within the foregoing limits and subject to the terms and conditions set forth herein, the Borrower may borrow, prepay and reborrow Loans. ","start":61124,"end":61735}],"document_name":"22_Zynga_evaluationset.txt"},{"document_answers":[{"text":"THE CREDITS\nCommitments. Subject to the terms and conditions set forth herein, (a) each Tranche A Lender agrees to make Tranche A Loans (denominated in dollars) to the Borrowers from time to time on any Business Day during the applicable Availability Period in an aggregate principal amount that will not result in (i) such Tranche A Lender’s applicable Credit Exposure exceeding such Tranche A Lender’s Tranche A Commitment or (ii) the sum of the total applicable Credit Exposures exceeding the total Tranche A Commitments and (b) each Tranche B Lender agrees to make Tranche B Loans (denominated in dollars) to the Borrowers from time to time on any Business Day during the applicable Availability Period in an aggregate principal amount that will not result in (i) such Tranche B Lender’s applicable Credit Exposure exceeding such Tranche B Lender’s Tranche B Commitment or (ii) the sum of the total applicable Credit Exposures exceeding the total Tranche B Commitments. Any Borrower may borrow Loans under the Tranche identified in the applicable Borrowing Request without the requirement to borrow under any other Tranche. Amounts paid or prepaid in respect of Term Loans may not be reborrowed.","start":71541,"end":72740}],"document_name":"11_Teva_trainingset.txt"},{"document_answers":[{"text":"2 \tThe Facilities \n2.1 \tThe Facilities \n\t2.1.1 \tSubject to the terms of this Agreement, the Lenders make available:","start":46428,"end":46543},{"text":"(iv) a Base Currency revolving credit facility in an aggregate amount equal to the Total Capex Facility Commitments capable of being reborrowed as contemplated by this Agreement (the “Capex Facility”); and  \n(v) a multi-currency working capital facility in an aggregate amount equal to the Total WC Facility Commitments, capable of being reborrowed as contemplated by this Agreement (the “WC Facility”). ","start":46917,"end":47321}],"document_name":"12_ellevio_trainingset.txt"},{"document_answers":[{"text":"2 The Facility \n2.1 \tThe Facility \nSubject to the terms of this Agreement, the Lenders make available to the Borrower a USD committed revolving credit facility in an aggregate amount equal to the Total Commitments. ","start":69620,"end":69835}],"document_name":"15_Harmony_trainingset.txt"},{"document_answers":[{"text":"THE CREDIT FACILITIES.\n Section 1.1. Revolving Credit Commitments. Subject to the terms and conditions hereof, each Lender severally agrees to make a loan or loans (individually a “Revolving Loan” and collectively “Revolving Loans”) to the Borrower from time to time on a revolving basis in U.S. Dollars and Alternative Currencies in an aggregate outstanding Original Dollar Amount up to the amount of its Revolving Credit Commitment subject to any increases or reductions thereof pursuant to the terms hereof, before the Termination Date.  The sum of the (i) aggregate Original Dollar Amount of Revolving Loans, (ii) the aggregate Original Dollar Amount of Swingline Loans, and (iii) the aggregate U.S. Dollar Equivalent of all L/C Obligations at any time outstanding shall not exceed the Revolving Credit Commitments in effect at such time.  The sum of the aggregate Original Dollar Amount of all Revolving Loans denominated in an Alternative Currency other than Euros or Pounds Sterling at any time outstanding shall not exceed $200,000,000.  Each Borrowing of Revolving Loans shall be made ratably from the Lenders in proportion to their respective Revolver Percentages.  As provided in Section 1.6(a) hereof, the Borrower may elect that each Borrowing of Revolving Loans denominated in U.S. Dollars be either Domestic Rate Loans or Eurocurrency Loans.  All Revolving Loans denominated in an Alternative Currency shall be Eurocurrency Loans.  Revolving Loans may be repaid and the principal amount thereof reborrowed before the Termination Date, subject to all the terms and conditions hereof.","start":12262,"end":13859}],"document_name":"05_JLL_trainingset.txt"},{"document_answers":[{"text":"2. THE FACILITIES\n2.1 The Facilities\nSubject to the terms of this Agreement, the Lenders make available: ","start":63119,"end":63224},{"text":"2.1.3 to the Borrowers, a multicurrency revolving credit facility in an aggregate amount equal to the Total Facility C Commitments being £2,000,000 at the date of this Agreement. ","start":63577,"end":63756}],"document_name":"19_Ixeurope_trainingset.txt"},{"document_answers":[{"text":"§2.\tTHE REVOLVING CREDIT FACILITY.\n§2.1. Commitment to Lend Revolving Credit Loans. Subject to the terms and conditions set forth in this Credit Agreement, each of the Lenders severally agrees from time to time during the Revolver Period to make Revolving Credit Loans to the Borrower in Dollars or","start":83555,"end":83853},{"text":"in one or more Alternative Currencies and in such amounts as are requested by the Borrower; provided, that the sum of the aggregate principal amount of Revolving Credit Loans made by each Lender (after giving effect to all amounts requested) shall not at any time exceed such Lender’s Commitment Amount; and provided, further, that (a) at no time shall the sum of, without duplication, (i) the Dollar Equivalent of the outstanding Revolving Credit Loans, plus (ii) the outstanding Swing Line Loans, plus (iii) the Maximum Drawing Amount, plus (iv) all Unpaid Reimbursement Obligations exceed the Total Commitment, (b) at no time shall the sum of, without duplication, (i) the Dollar Equivalent of the aggregate outstanding Loans denominated in Alternative Currencies plus (ii) the Maximum Drawing Amount of all Letters of Credit denominated in Alternative Currencies plus (iii) all Unpaid Reimbursement Obligations with respect to Letters of Credit denominated in Alternative Currencies exceed the Alternative Currency Sublimit and (c) subject to §2.4.1, at all times the Dollar Equivalent of the outstanding aggregate principal amount of all Revolving Credit Loans made by each Lender shall equal such Lender’s Commitment Percentage of the outstanding Revolving Credit Loans made by all Lenders pursuant to the terms of this Credit Agreement. Subject to the terms and conditions set forth in this Credit Agreement, the Borrower may borrow, repay and reborrow Revolving Credit Loans from time to time during the Revolver Period upon notice by the Borrower to the Administrative Agent given in accordance with §2.2 hereof. Each request for a Revolving Credit Loan hereunder shall constitute a representation and warranty by the Borrower that the conditions set forth in §§9 and 10 hereof, in the case of the initial Revolving Credit Loans to be made on the Closing Date, and §10 hereof, in the case of all other Revolving Credit Loans, shall have been satisfied on the date of such request.","start":83882,"end":85871}],"document_name":"30_Staples_evaluationset.txt"},{"document_answers":[{"text":"COMMITMENTS AND CREDIT EXTENSIONS\n2.1 Committed Loans.  Subject to the terms and conditions set forth herein, each Lender severally agrees to make loans (each such loan, a “Committed Loan”) to the Borrower in Dollars or in one or more Alternative Currencies from time to time, on any Business Day during the Availability Period, in an aggregate amount not to exceed at any time outstanding the amount of such Lender’s Commitment; provided, however, that after giving effect to any Committed Borrowing, (i) the Total Outstandings shall not exceed the Aggregate Commitments, and (ii) the Total Credit Exposure of any Lender shall not exceed such Lender’s Commitment.  Within the limits of each Lender’s Commitment, and subject to the other terms and conditions hereof, the Borrower may borrow under this Section 2.01, prepay under Section 2.05, and reborrow under this Section 2.01.  Committed Loans may be Base Rate Loans or Eurocurrency Rate Loans, as further provided herein.","start":114824,"end":115800}],"document_name":"10_Clarcor_trainingset.txt"},{"document_answers":[{"text":"2.\tTHE FACILITY\n2.1\tThe Facility\n(a) Subject to the terms of this Agreement, the Lenders make available to the Borrowers a multicurrency revolving loan facility in an aggregate amount the Base Currency Amount of which is equal to the Total Commitments.","start":76139,"end":76391}],"document_name":"18_Interxion_trainingset.txt"},{"document_answers":[{"text":"2. The Facilities\n2.1 The Facilities\nSubject to the terms of this Agreement:","start":142235,"end":142311},{"text":"the Facility B Lenders make available to the Borrower a revolving credit facility in Singapore Dollars in an aggregate amount equal to the Total Facility B Commitments (parts of which may, from time to time and in an aggregate amount at any time up to the Total Ancillary Limit, be designated as Ancillary Facilities)","start":142482,"end":142799}],"document_name":"23_Marina_evaluationset.txt"},{"document_answers":[{"text":"2. THE FACILITIES\n2.1\tThe Facilities\n(a) Subject to the terms of this Agreement, the Lenders make available:","start":133081,"end":133189},{"text":"to the Revolving Facility Borrowers, a multicurrency revolving credit facility in an aggregate Base Currency Amount which is equal to the Total Original Revolving Facility Commitments.","start":133437,"end":133621}],"document_name":"25_Nomad__evaluationset.txt"},{"document_answers":[{"text":"2. THE FACILITIES \n2.1 \tThe Facilities \n(a) Subject to the terms of this Agreement, the Lenders make available: ","start":135598,"end":135710},{"text":"(ii) to the Borrowers, a multicurrency revolving credit facility in an aggregate amount, the Base Currency Amount of which is equal to the Total Revolving Facility Commitments. ","start":135864,"end":136041}],"document_name":"08_Chain_trainingset.txt"},{"document_answers":[{"text":"THE CREDITS \nSECTION 2.01. Revolving Loans","start":93171,"end":93213},{"text":"(a) Revolving Loans. Subject to the terms and conditions of this Agreement, and in reliance upon the \nrepresentations and warranties set forth herein, each Revolving Credit Lender severally agrees to make Revolving Loans in a Permitted Currency to the Borrower from time to time from the Closing Date through, but not including, the Maturity Date as requested by the Borrower in accordance with the terms of Section 2.03, provided that based upon the Equivalent Dollar Amount of all outstanding Revolving Loans, Competitive Bid Loans and L/C Obligations, (i) the aggregate amount of the Revolving Commitments shall be deemed used from time to time to the extent of the aggregate amount of the Competitive Bid Loans then outstanding and such deemed use of the aggregate amount of the Revolving Commitments shall be allocated among the Revolving Credit Lenders ratably according to their respective Revolving \nCommitments (such deemed use of the aggregate amount of the Revolving Commitments being a “Competitive Bid Reduction”), (ii) the aggregate principal amount of all outstanding Revolving Loans (after giving effect to any amount requested and the use of the proceeds thereof) shall not exceed the Revolving Commitment (as reduced by any Competitive Bid Reduction) minus the sum of all outstanding Swingline Loans and L/C Obligations, (iii) the aggregate principal amount of all outstanding Revolving Loans made in an Alternative Currency (after giving effect to any amount requested and the use of the proceeds thereof) plus the L/C Obligations with respect to all Alternative Currency Letters of Credit shall not exceed the Alternative Currency Commitment and (iv) the aggregate principal amount of all outstanding Revolving Loans (after giving effect to any amount requested and the use of the proceeds thereof) from any Revolving Credit Lender to the Borrower shall not at any time exceed such Revolving Credit Lender’s Revolving Commitment (as reduced by such Revolving Credit Lender’s Pro Rata Percentage of any Competitive Bid Reduction) minus such Revolving Credit Lender’s Pro Rata Percentage of (A) outstanding Swingline Loans and (B) outstanding L/C Obligations. Each Revolving Loan by a Revolving Credit Lender shall be in a principal amount equal to such Revolving Credit Lender’s Pro Rata Percentage of the aggregate principal amount of Revolving Loans requested on such occasion. Subject to the terms and conditions hereof, the Borrower may borrow, repay and reborrow Revolving Loans hereunder until the Maturity Date. ","start":93250,"end":95788}],"document_name":"16_CHOICE_trainingset.txt"},{"document_answers":[{"text":"2.2. Revolving Loans. (a) Revolving Commitments. During the Revolving Commitment Period, subject to the terms and conditions hereof, each Lender agrees to make Revolving Loans in US Dollars to the Borrowers in an aggregate principal amount that will not result in (i) such Lender’s Revolving Exposure exceeding such Lender’s Revolving Commitment, (ii) the Total Utilization of Revolving Commitments exceeding the Total Revolving Commitments or (iii) the Borrowing Base Coverage Ratio being less than 1.10:1.00. Amounts borrowed pursuant to this Section 2.2(a) that are repaid or prepaid may, subject to the terms and conditions hereof, be reborrowed during the Revolving Commitment Period. Each Lender’s Revolving Commitment shall terminate on the Revolving Commitment Termination Date.","start":216236,"end":217022}],"document_name":"14_CHRYSLER_trainingset.txt"},{"document_answers":[{"text":"SECTION 2.01. Commitments.\n(a) Subject to the terms and conditions set forth herein, each Revolving Lender severally\nagrees to make Revolving Loans to the Borrowers from time to time during the Availability Period in an aggregate principal amount that will not result in (i) such Lender’s Revolving Credit Exposure exceeding such Revolving Lender’s Revolving Commitment or (ii) the sum of the total Revolving Credit Exposures exceeding the Revolving Credit Line Cap. Within the foregoing limits and subject to the terms and conditions set forth herein, the Borrowers may borrow, prepay and reborrow Revolving Loans","start":204567,"end":205181}],"document_name":"01_JCP_trainingset.txt"},{"document_answers":[{"text":"ARTICLE II \nTHE COMMITMENTS AND CREDIT EXTENSIONS \n2.01 Committed Loans; Reserves. (a) Subject to the terms and conditions set forth herein, each Lender severally agrees to make loans (each such loan, a “Committed Loan”) to the Borrowers from time to time, on any Business Day during the Availability Period, in an aggregate outstanding amount not to exceed at any time the lesser of (x) the amount of such Lender’s Commitment, or (y) such Lender’s Applicable Percentage of the Borrowing Base, subject in each case to the following limitations: \n(i) after giving effect to any Committed Borrowing, the Total Outstandings shall not exceed the Loan \nCap, \n(ii) after giving effect to any Committed Borrowing, the aggregate Outstanding Amount of the \nCommitted Loans of any Lender, plus such Lender’s Applicable Percentage of the Outstanding Amount of all LC Obligations, plus such Lender’s Applicable Percentage of the Outstanding Amount of all Swing Line Loans shall not exceed such Lender’s Commitment","start":174640,"end":175641},{"text":"(iii) the Outstanding Amount of all LC Obligations shall not at any time exceed the Letter of Credit Sublimit \nWithin the limits of each Lender’s Commitment, and subject to the other terms and conditions hereof, the Borrowers may borrow under this Section 2.01, prepay under Section 2.05, and reborrow under this Section 2.01. Committed Loans may be Base Rate Loans or LIBO Rate Loans, as further provided herein.","start":175648,"end":176061}],"document_name":"21_B&N_evaluationset.txt"},{"document_answers":[{"text":"2. THE FACILITIES\n2.1 The Original Revolving Facility\nSubject to the terms of this Agreement, the Lenders make available to the Borrowers a euro revolving credit facility in an aggregate amount equal to the Total Original Revolving Facility Commitments.","start":95034,"end":95287}],"document_name":"04_Unitymedia_trainingset.txt"},{"document_answers":[{"text":"ARTICLE II \nThe Commitments and Credit Extensions \nSECTION 2.01. The Loans.","start":199548,"end":199623},{"text":"(b) The Revolving Credit Borrowings. Subject to the terms and conditions set forth herein, each Revolving Credit Lender severally agrees to make Loans denominated in Dollars or an Alternative Currency to the Borrower from its applicable Lending Office (each such loan, a “Revolving Credit Loan”) from time to time, on any Business Day during the period from and including the Distribution Date until the Business Day preceding the Maturity Date for the Revolving Credit Facility; provided, that after giving effect to any Revolving Credit Borrowing, (i) the Revolving Credit Exposure of any Revolving Credit Lender shall not exceed such Lender’s Revolving Credit Commitment, (ii) the aggregate Alternative Currency Exposures (excluding those in respect of Letters of Credit denominated in a Permitted Additional L/C Currency) shall not exceed the Alternative Currency Sublimit and (iii) the aggregate Revolving Credit Exposures shall not exceed the aggregate Revolving Credit Commitments. Within the limits of each Lender’s Revolving Credit Commitment, and subject to the other terms and conditions hereof, the Borrower may borrow under this Section 2.01(b), prepay under Section 2.04, and reborrow under this Section 2.01(b). Revolving Credit Loans denominated in Dollars may be Base Rate Loans or Eurocurrency Rate Loans, and Revolving Credit Loans denominated in an Alternative Currency shall be Eurocurrency Rate Loans, in each case, as further provided herein.","start":200065,"end":201530}],"document_name":"26_TIME_evaluationset.txt"},{"document_answers":[{"text":"The Credits\nSECTION 2.01. Commitments. Subject to the terms and conditions herein set forth, each Lender agrees to make Revolving Loans to the Borrower from time to time during the Availability Period in an aggregate principal amount that will not result in (i) such Lender’s Revolving Exposure exceeding such Lender’s Revolving Commitment or (ii) the sum of (A) the total Revolving Exposures (excluding the Floorplan Loan Exposure) plus (B) the Floorplan Collateral Block exceeding the lesser of (x) the sum of the total Revolving Commitments or (y) the Borrowing Base, subject to the Administrative Agent’s authority, in its sole discretion, to make Protective Advances pursuant to the terms of Section 2.25. Within the foregoing limits and subject to the terms and conditions set forth herein, the Borrower may borrow, prepay and reborrow Revolving Loans. ","start":188182,"end":189041}],"document_name":"17_CDW_trainingset.txt"},{"document_answers":[{"text":"Section 2.20 The Revolving Facility. \n(a) Subject to the terms of this Agreement, the Lenders shall make available a multicurrency revolving credit \nfacility in an aggregate amount the Base Currency Amount of which is equal to the Total Revolving Facility Commitments. \n(b) Subject to the terms of this Agreement and the Ancillary Documents, an Ancillary Lender may make \navailable an Ancillary Facility to any of the Borrowers in place of all or part of its Revolving Facility Commitment. ","start":259704,"end":260194}],"document_name":"24_Wireco_evaluationset.txt"},{"document_answers":[{"text":"Section 2.01 Commitments.\n(a) Subject to the terms and conditions and relying upon the representations and warranties herein set forth, each Lender agrees, severally and not jointly to make\n(x) Australian Revolving Loans in dollars to any Australian Borrower, (y) Dutch Revolving Loans, at the applicable Borrower’s option, in dollars or euros to any Dutch Borrower and (z) U.S. Revolving Loans, at the applicable Borrower’s option, in dollars or euros to any U.S. Borrower, in each case at any time and from time to time on or after the Closing Date until the earlier of one Business Day prior to the Revolving Maturity Date and the termination of the Revolving Commitment of such Lender in accordance with the terms hereof, in an aggregate principal amount at any time outstanding that will not result in:\n(i) such Lender’s Revolving Exposure exceeding such Lender’s Revolving Commitment; or\n(ii) the sum of the total Revolving Exposures exceeding the lesser of (A) the total Revolving Commitments and (B) the Aggregate Borrowing Base then ineffect.","start":222242,"end":223293}],"document_name":"02_Tronox_trainingset.txt"},{"document_answers":[{"text":"2.1 \tCommitment. \n\t2.1.1 \tRevolver Loans. \n(a) ANZ Revolver Loans to ANZ Borrowers.  Each ANZ Revolver Lender has made ANZ Revolver Loans to ANZ Borrowers prior to the Restatement Closing Date, and agrees, severally and not jointly with the other ANZ Revolver Lenders, upon the terms and subject to the conditions set forth herein, to make ANZ Revolver Loans to any of the ANZ Borrowers on any Business Day during the period from the Restatement Closing Date to the ANZ Revolver Commitment Termination Date, not to exceed in aggregate principal amount outstanding at any time (based on the Dollar Equivalent thereof), together with such ANZ Revolver Lender’s portion of the ANZ LC Obligations, such ANZ Revolver Lender’s ANZ Revolver Commitment at such time, which ANZ Revolver Loans may be repaid and reborrowed in accordance with the provisions of this Agreement; provided, however, that ANZ Revolver Lenders shall have no obligation to the ANZ Borrowers whatsoever to honor any request for a ANZ Revolver Loan on or after the ANZ Revolver Commitment Termination Date or if the \nDollar Equivalent of the amount of the proposed ANZ Revolver Loan exceeds ANZ Availability on the proposed funding date for such ANZ Revolver Loan.","start":418460,"end":419688},{"text":"(b) Canadian Revolver Loans to Canadian Borrowers.  Each Canadian Revolver Lender has made Canadian Revolver Loans to the Canadian Borrowers prior to the Restatement Closing Date, and agrees, severally and not jointly with the other Canadian Revolver Lenders, upon the terms and subject to the conditions set forth herein, to make Canadian Revolver Loans to any of the Canadian Borrowers on any Business Day during the period from the Restatement Closing Date to the Canadian Revolver Commitment Termination Date, not to exceed in aggregate principal amount outstanding at any time (based on the Dollar Equivalent thereof), together with such Canadian Revolver Lender’s portion of the Canadian LC Obligations, such Canadian Revolver Lender’s Canadian Revolver Commitment at such time, which Canadian Revolver Loans may be repaid and reborrowed in accordance with the provisions of this Agreement; provided, however, that Canadian Revolver Lenders shall have no obligation to the Canadian Borrowers whatsoever to honor any request for a Canadian Revolver Loan on or after the Canadian Revolver Commitment Termination Date or if the Dollar Equivalent of the amount of the proposed Canadian Revolver Loan exceeds Canadian Availability on the proposed funding date for such Canadian Revolver Loan.","start":422332,"end":423625},{"text":"(c) UK Revolver Loans to UK Borrowers.  Each UK Revolver Lender \nhas made UK Revolver Loans to the UK Borrowers prior to the Restatement Closing Date, and agrees, severally and not jointly with the other UK Revolver Lenders, upon the terms and subject to the conditions set forth herein, to make UK Revolver Loans to any of the UK Borrowers on any Business Day during the period from the Restatement Closing Date to the UK Revolver Commitment Termination Date, not to exceed in aggregate principal amount outstanding at any time (based on the Dollar Equivalent thereof), together with such UK Revolver Lender’s portion of the UK LC Obligations, such UK Revolver Lender’s UK Revolver Commitment at such time, which UK Revolver Loans may be repaid and reborrowed in accordance with the provisions of this \nAgreement; provided, however, that UK Revolver Lenders shall have no obligation to the \nUK Borrowers whatsoever to honor any request for a UK Revolver Loan on or after the UK Revolver Commitment Termination Date or if the Dollar Equivalent of the amount of the proposed UK Revolver Loan exceeds UK Availability on the proposed funding date for such UK Revolver Loan.","start":424817,"end":425987},{"text":"(d) U.S. Revolver Loans to U.S. Borrowers.  Each U.S. Revolver Lender has made U.S.  Revolver Loans to the U.S. Borrowers prior to the Restatement Closing Date, and agrees, severally and not jointly with the other U.S. Revolver Lenders, upon the terms and subject to the conditions set forth herein, to make U.S. Revolver Loans to any of the U.S. Borrowers on any Business Day during the period from the Restatement Closing Date to the U.S. Revolver Commitment Termination Date, not to exceed in aggregate principal amount outstanding at any time, together with such U.S. Revolver Lender’s portion of the U.S. LC Obligations, such U.S. Revolver Lender’s U.S. Revolver Commitment at such time, which U.S. Revolver Loans may be repaid and reborrowed in accordance with the provisions of this Agreement; provided, however, that such U.S. Revolver Lenders shall have no obligation to U.S. Borrowers whatsoever to honor any request for a U.S. Revolver Loan on or after the U.S. Revolver Commitment \nTermination Date or if the amount of the proposed U.S. Revolver Loan exceeds U.S. Availability on the proposed funding date for such U.S. Revolver Loan.","start":427345,"end":428491}],"document_name":"07_OPT1_trainingset.txt"}]}]